/******************************************************************************
**	(C) Copyright 2007 Marvell International Ltd. ?**	All Rights Reserved
******************************************************************************/

/******************************************************************************
**
**  COPYRIGHT (C) 2002, 2003 Intel Corporation.
**
**  This software as well as the software described in it is furnished under
**  license and may only be used or copied in accordance with the terms of the
**  license. The information in this file is furnished for informational use
**  only, is subject to change without notice, and should not be construed as
**  a commitment by Intel Corporation. Intel Corporation assumes no
**  responsibility or liability for any errors or inaccuracies that may appear
**  in this document or any software that may be provided in association with
**  this document.
**  Except as permitted by such license, no part of this document may be
**  reproduced, stored in a retrieval system, or transmitted in any form or by
**  any means without the express written consent of Intel Corporation.
**
**  FILENAME:	PlatformConfig.h
**
**  PURPOSE: 	Platform specific header to set parameters
**
**
******************************************************************************/

#ifndef __platform_config_h
#define __platform_config_h

/*#include "Typedef.h"
#include "Errors.h"
#include "ProtocolManager.h"
#include "misc.h"
#include "pmic.h"

#define nCS1 		(volatile unsigned long *)( 0x40E100C4 )  //
#define EMPI_SCLK 	(volatile unsigned long *)( 0x40E100CC )  //

#define U2DOTGCR_	(volatile unsigned long *)( 0x54100020 )  //U2D OTG Control Register
#define U2DOTGICR_	(volatile unsigned long *)( 0x54100024 )  //U2D OTG Interrupt Control Register
#define U2DOTGUCR_	(volatile unsigned long *)( 0x54100030 )  //U2D OTG ULPI Control Register

// Tavor UART GPIO definition
#define GPIO47_TAVOR (volatile unsigned long *)( 0x40E102BC )  // FFUART_DSR
#define GPIO48_TAVOR (volatile unsigned long *)( 0x40E102B4 )  // FFUART_DTR
#define GPIO49_TAVOR (volatile unsigned long *)( 0x40E102B8 )  // FFUART_RI
#define GPIO50_TAVOR (volatile unsigned long *)( 0x40E102C8 )  // FFUART_DCD
#define GPIO51_TAVOR (volatile unsigned long *)( 0x40E102C0 )  // FFUART_CTS
#define GPIO52_TAVOR (volatile unsigned long *)( 0x40E102C4 )  // FFUART_RTS
#define GPIO53_TAVOR (volatile unsigned long *)( 0x40E102D0 )  // FFUART_RXD
#define GPIO54_TAVOR (volatile unsigned long *)( 0x40E102CC )  // FFUART_TXD
#define GPIO101_TAVOR (volatile unsigned long *)( 0x40E10408 )  // ALT UART TXD
#define GPIO100_TAVOR (volatile unsigned long *)( 0x40E10414 )  // ALT UART RXD
// Tavor USB PORT_2 GPIO definition
#define GPIO70_TAVOR (volatile unsigned long *)( 0x40E102A0 )  // USB_P2_4
#define GPIO71_TAVOR (volatile unsigned long *)( 0x40E10294 )  // USB_P2_8
#define GPIO72_TAVOR (volatile unsigned long *)( 0x40E10298 )  // USB_P2_5
#define GPIO73_TAVOR (volatile unsigned long *)( 0x40E1029C )  // USB_P2_2
#define GPIO74_TAVOR (volatile unsigned long *)( 0x40E102A8 )  // USB_P2_7
#define GPIO75_TAVOR (volatile unsigned long *)( 0x40E102A4 )  // USB_P2_1
#define GPIO76_TAVOR (volatile unsigned long *)( 0x40E102B0 )  // USB_P2_3
#define GPIO77_TAVOR (volatile unsigned long *)( 0x40E102AC )  // USB_P2_6

// Tavor ULPI GPIO's
#define GPIO30 		(volatile unsigned long *)( 0x40E10618 )  // ULPI Data 0
#define GPIO31 		(volatile unsigned long *)( 0x40E10610 )  // .
#define GPIO33 		(volatile unsigned long *)( 0x40E1061C )  // .
#define GPIO34 		(volatile unsigned long *)( 0x40E10620 )  // .
#define GPIO35 		(volatile unsigned long *)( 0x40E10628 )  // .
#define GPIO36 		(volatile unsigned long *)( 0x40E1062C )  // .
#define GPIO37 		(volatile unsigned long *)( 0x40E10630 )  // ULPI Data 6
#define GPIO38		(volatile unsigned long *)( 0x40E10634 )  // ULPI_CLK
#define GPIO39 		(volatile unsigned long *)( 0x40E10638 )  // ULPI STP
#define GPIO40 		(volatile unsigned long *)( 0x40E1063C )  // ULPI Data 7
#define GPIO41 		(volatile unsigned long *)( 0x40E10614 )  // ULPI DIR
#define GPIO42 		(volatile unsigned long *)( 0x40E10624 )  // ULPI NXT


#define GPDR1_32_63	0x40E00010
#define GPLR1_32_63	0x40E00004
#define GPSR1_32_63 0x40E0001C	
#define GPCR1_32_63 0x40E00028

#define GPIO152     (volatile unsigned long *)( 0x40E10624 )  // RDY

//
// Relevant and common GPIO memory mapped register needed for configuring flash
// signal list.
//
#define SMEMC_BASE	   0x4A000000

typedef struct 
{
  volatile int *    registerAddr;
  unsigned int      regValue;
  unsigned int      defaultValue;
}CS_REGISTER_PAIR_S, *P_CS_REGISTER_PAIR_S;

//Prototypes
UINT_T ChipSelect0(void);
UINT_T ChipSelect2(void);
void ChipSelectDFC(void);
void RestoreDefaultConfig(void);
void SaveDefaultConfig(void);
void PlatformInitDefaultClock(void);


//UART
UINT_T PlatformUARTConfig(void);


#if (USBCI)
//CI2 USB Functions
void PlatformCI2Init(void);
UINT_T PlatformCI2Transmit(UINT_T, UINT8_T*, UINT_T);
void PlatformCI2Shutdown(void);
void PlatformCI2InterruptHandler(void);

/* USBCI PHY structure - until Eshel chip (phy at top level) */
#define USB_PHY_BASE_ADDR            0x5550A000
typedef struct _usb_phy_registers
{
    unsigned int   U2PPLL;     	     //0x00 - USB2 PHY PLL Control
	unsigned int   U2PTX;     	     //0x04 - USB2 PHY TX Control
	unsigned int   U2PRX;     	     //0x08 - USB2 PHY RX Control
	unsigned int   U2PIVREF;         //0x0C - USB2 PHY IVREF Control
	unsigned int   PHY_T0;           //0x10 - phy control register
	unsigned int   U2PT1;            //0x14 - USB2 PHY Test 1 Control
	unsigned int   U2PT2;            //0x18 - USB2 PHY Test 2 Control
	unsigned int   U2PT3;            //0x1C - USB2 PHY Test 3 Control
	unsigned int   U2PT4;            //0x20 - USB2 PHY Test 4 Control
	unsigned int   U2PT5;            //0x24 - USB2 PHY Test 5 Control
	unsigned int   U2PID;            //0x28 - USB2 PHY ID Register
	unsigned int   U2PRS;            //0x2C - USB2 PHY Reserve Register
} usb_phy_registers;

/* USBCI PHY structure - from Eshel chip (phy as module) */
#define USB_PHY_MODULE_BASE_ADDR     0x42405E00
typedef struct _usb_phy_module
{
    unsigned int   PHYID;     	     //0x00 - PHY Identification Register
	unsigned int   PLL_CTRL_0;     	 //0x04 - PLL Control Register0
	unsigned int   PLL_CTRL_1;     	 //0x08 - PLL Control Register1
	unsigned int   PLL_CTRL_2;     	 //0x0C - PLL Control Register2
	unsigned int   TX_CH_CTRL_0;     //0x10 - TX Channel Control register0
	unsigned int   TX_CH_CTRL_1;     //0x14 - TX Channel Control register1
	unsigned int   TX_CH_CTRL_2;     //0x18 - TX Channel Control register2
	unsigned int   TX_CH_CTRL_3;     //0x1C - TX Channel Control register3
	unsigned int   RX_CH_CTRL_0;     //0x20 - RX Channel Control register0
	unsigned int   RX_CH_CTRL_1;     //0x24 - RX Channel Control register0
	unsigned int   RX_CH_CTRL_2;     //0x28 - RX Channel Control register0
	unsigned int   RX_CH_CTRL_3;     //0x2C - RX Channel Control register0
	unsigned int   ANALOG_CTRL_0;    //0x30 - Analog Top Control register0
	unsigned int   ANALOG_CTRL_1;    //0x34 - Analog Top Control register1
	unsigned int   ANALOG_CTRL_2;    //0x38 - Analog Top Control register2
	unsigned int   DIGITAL_CTRL_0;   //0x3C - Digital Control register0
	unsigned int   DIGITAL_CTRL_1;   //0x40 - Digital Control register1
	unsigned int   DIGITAL_CTRL_2;   //0x44 - Digital Control register2
	unsigned int   DIGITAL_CTRL_3;   //0x48 - Digital Control register3
	unsigned int   TEST_CTRL_0 ;     //0x4C - Test Control and status register0
	unsigned int   TEST_CTRL_1 ;     //0x50 - Test Control and status register1
	unsigned int   TEST_CTRL_2 ;     //0x54 - Test Control and status register2
	unsigned int   CHARGERDTCT_CTRL; //0x58 - Charger detector control register
	unsigned int   OTG_CTRL_0;       //0x5C - OTG control register0
	unsigned int   PHY_MON_STATUS;   //0x60 - Read PHY_MON[15:0]
	unsigned int   DIGITAL_CTRL_4;   //0x64 - Digital Control register4
	unsigned int   reserved1[3];     //0x68 - 0x74 - reserved
	unsigned int   INTERNALCID_0;    //0x78 - usb2_icid_reg0
	unsigned int   INTERNALCID_1;    //0x7C - usb2_icid_reg1
} usb_phy_module;

/* usb_phy_module bits */
#define USB2_PLL_FBDIV_SHIFT				0
#define USB2_PLL_REFDIV_SHIFT				8
#define USB2_PLL_REFDIV_SHIFT_NEW_PHY		9

#define USB2_PLL_VDD12_SHIFT				12
#define USB2_PLL_VDD18_SHIFT				14


#define USB2_PLL_FBDIV_MASK					0x00FF
#define USB2_PLL_REFDIV_MASK				0x0F00


#define USB2_PLL_FBDIV_MASK_NEW_PHY			0x01FF
#define USB2_PLL_REFDIV_MASK_NEW_PHY		0x3E00


#define USB2_PLL_PLLVDD12_MASK				(0x3 << 12)
#define USB2_PLL_PLLVDD18_MASK				(0x3 << 14)

#define USB2_PLL_CAL12_SHIFT				0
#define USB2_PLL_VCOCALL_START				2
#define USB2_PLL_CLK_BLK_EN_SHIFT			3
#define USB2_PLL_KVCO_SHIFT					4
#define USB2_PLL_KVCO_EXE_SHIFT				7
#define USB2_PLL_ICP_SHIFT					8
#define USB2_PLL_LOCKDET_ISEL_SHIFT			11
#define USB2_PLL_LOCK_BYPASS_SHIFT			12
#define USB2_PLL_PU_PLL_SHIFT				13
#define USB2_PLL_CONTROL_BY_PIN_SHIFT		14
#define USB2_PLL_READY_SHIFT				15
#define USB2_PLL_CALI12_MASK				(0x3)
